
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Красный = Параметры.Цвет.Красный;
	Зеленый = Параметры.Цвет.Зеленый;
	Синий = Параметры.Цвет.Синий;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИзменитьЦвет();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#Область ГруппаКрасный

&НаКлиенте
Процедура КрасныйПриИзменении(Элемент)
	ИзменитьЦвет();
КонецПроцедуры

&НаКлиенте
Процедура РегулировщикКрасныйПриИзменении(Элемент)
	ИзменитьЦвет();
КонецПроцедуры

#КонецОбласти

#Область ГруппаЗеленый

&НаКлиенте
Процедура ЗеленыйПриИзменении(Элемент)
	ИзменитьЦвет();
КонецПроцедуры

&НаКлиенте
Процедура РегулировщикЗеленыйПриИзменении(Элемент)
	ИзменитьЦвет();
КонецПроцедуры

#КонецОбласти

#Область ГруппаСиний

&НаКлиенте
Процедура СинийПриИзменении(Элемент)
	ИзменитьЦвет();
КонецПроцедуры

&НаКлиенте
Процедура РегулировщикСинийПриИзменении(Элемент)
	ИзменитьЦвет();
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьЦвет(Команда)
	Закрыть(ВыбранныйЦвет);
КонецПроцедуры

#Область ПалитраЦветов

&НаКлиенте
Процедура ЦветЧерный(Команда)
	Красный = 0;
	Зеленый = 0;
	Синий   = 0;
	
	ИзменитьЦвет();
КонецПроцедуры

&НаКлиенте
Процедура ЦветСерый(Команда)
	Красный = 128;
	Зеленый = 128;
	Синий   = 128;
	
	ИзменитьЦвет();
КонецПроцедуры

&НаКлиенте
Процедура ЦветТемноКрасный(Команда)
	Красный = 128;
	Зеленый = 0;
	Синий   = 0;
	
	ИзменитьЦвет();
КонецПроцедуры

&НаКлиенте
Процедура ЦветКрасный(Команда)
	Красный = 255;
	Зеленый = 0;
	Синий   = 0;
	
	ИзменитьЦвет();
КонецПроцедуры

&НаКлиенте
Процедура ЦветОранжевый(Команда)
	Красный = 255;
	Зеленый = 127;
	Синий   = 39;
	
	ИзменитьЦвет();
КонецПроцедуры

&НаКлиенте
Процедура ЦветЖелтый(Команда)
	Красный = 255;
	Зеленый = 242;
	Синий   = 0;
	
	ИзменитьЦвет();
КонецПроцедуры

&НаКлиенте
Процедура ЦветЗеленый(Команда)
	Красный = 34;
	Зеленый = 177;
	Синий   = 76;
	
	ИзменитьЦвет();
КонецПроцедуры

&НаКлиенте
Процедура ЦветБирюзовый(Команда)
	Красный = 0;
	Зеленый = 162;
	Синий   = 232;
	
	ИзменитьЦвет();
КонецПроцедуры

&НаКлиенте
Процедура ЦветИндиго(Команда)
	Красный = 63;
	Зеленый = 72;
	Синий   = 204;
	
	ИзменитьЦвет();
КонецПроцедуры

&НаКлиенте
Процедура ЦветЛиловый(Команда)
	Красный = 163;
	Зеленый = 73;
	Синий   = 164;
	
	ИзменитьЦвет();
КонецПроцедуры

&НаКлиенте
Процедура ЦветБелый(Команда)
	Красный = 255;
	Зеленый = 255;
	Синий   = 255;
	
	ИзменитьЦвет();
КонецПроцедуры

&НаКлиенте
Процедура ЦветРозовый(Команда)
	Красный = 255;
	Зеленый = 174;
	Синий   = 201;
	
	ИзменитьЦвет();
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ИзменитьЦвет()
	ВыбранныйЦвет = Новый Цвет(Красный, Зеленый, Синий);
	Элементы.ТекущийЦвет.ЦветФона = ВыбранныйЦвет;
КонецПроцедуры

#КонецОбласти
