#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновлениеОтветственных" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытияФормы = Новый СТруктура;
	ПараметрыОткрытияФормы.Вставить("Регион", ТекущиеДанные.Регион);
	ОткрытьФорму("Обработка.УБХНазначениеОтветственныхПоФилиаламРегионов.Форма.Форма", ПараметрыОткрытияФормы, ЭтотОбъект, УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьНовыйСубъект(Команда)
	
	ОткрытьФорму("Обработка.УБХНазначениеОтветственныхПоФилиаламРегионов.Форма.Форма",, ЭтотОбъект, УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.Независимый);

КонецПроцедуры

#КонецОбласти
