
#Область ОбработчикиСобытийОбъекта

Процедура ПередЗаписью(Отказ)
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Имя) Тогда
		СформироватьИмяШаблона();	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ЭтотОбъект.ИсходныйШаблон = ОбъектКопирования.Ссылка;
	ЭтотОбъект.Имя = "";
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьИмяШаблона()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	лм_ШаблоныБизнесПроцессов.Имя КАК Имя
	               |ИЗ
	               |	Справочник.лм_ШаблоныБизнесПроцессов КАК лм_ШаблоныБизнесПроцессов";
	
	МассивСуществующих = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Имя");
	
	ЭтотОбъект.Имя = лм_СтроковыеФункцииКлиентСервер.ПолучитьВалидныйИдентификатор(ЭтотОбъект.Наименование, МассивСуществующих);
	
КонецПроцедуры

#КонецОбласти