
#Область ОбработчикиВводаЗначений

Функция ПараметрыФормыОбработчика(ОбработчикВводаЗначения, ИсходноеЗначение = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура();
	
	Для Каждого СтрокаПараметра Из ОбработчикВводаЗначения.ПараметрыФормыОбработчика Цикл
		ПараметрыФормы.Вставить(СтрокаПараметра.ИмяПараметра, СтрокаПараметра.Значение);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ОбработчикВводаЗначения.ПолеИсходногоЗначения) Тогда
		ПараметрыФормы.Вставить(ОбработчикВводаЗначения.ПолеИсходногоЗначения, ИсходноеЗначение);
	КонецЕсли;
	
	ПараметрыФормы.Вставить("Представление", ИсходноеЗначение);
	
	Возврат Параметрыформы;
	
КонецФункции

#КонецОбласти



#Область СлужебныеПроцедурыИФункции

Функция ЗначениеРеквизита(Ссылка, ИмяРеквизита) Экспорт
	
	Возврат Ссылка[ИмяРеквизита];
	
КонецФункции

#КонецОбласти