
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтение
	|ГДЕ
	|	ЭтоГруппа
	|	ИЛИ ЗначениеРазрешено(Ссылка)
	|;
	|РазрешитьИзменениеЕслиРазрешеноЧтение
	|ГДЕ
	|	ЭтоГруппа
	|	ИЛИ ЗначениеРазрешено(Ссылка)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Возвращает список объектов слоя.
//
// Параметры:
//  СлойКарты	 - СправочникСсылка.гис.СлоиКарты - слой, по которому нужно получить список объектов.
// 
// Возвращаемое значение:
//   - СписокЗначений - список элементов СправочникСсылка.гисОбъектыКарты.
//
Функция ПолучитьСписокОбъектов(СлойКарты) Экспорт
	СписокОбъектов = Новый СписокЗначений;
	
	Если СлойКарты.ТипСлоя = Перечисления.гисТипыСлоев.ПоСправочникуОбъектыКарты Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ Ссылка ИЗ Справочник.гисОбъектыКарты ГДЕ НЕ ПометкаУдаления И Слой = &Слой");
		Запрос.УстановитьПараметр("Слой", СлойКарты);
		МассивОбъектов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
		СписокОбъектов.ЗагрузитьЗначения(МассивОбъектов);
	КонецЕсли;
	
	Возврат СписокОбъектов;
КонецФункции

#КонецОбласти

#КонецЕсли
