
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Не ЭтоГруппа Тогда
		ПроверяемыеРеквизиты.Добавить("ТипСлоя");
			
		Если ТипСлоя = Перечисления.гисТипыСлоев.ПоСправочникуОбъектыКарты Тогда
			ПроверяемыеРеквизиты.Добавить("ТипГеометрии");
			Если ТипГеометрии = Перечисления.гисТипыГеометрии.Точка Тогда
				ПроверяемыеРеквизиты.Добавить("Картинка");
			КонецЕсли;
		ИначеЕсли ТипСлоя = Перечисления.гисТипыСлоев.ИзФайла Тогда
			ПроверяемыеРеквизиты.Добавить("ФорматГеоданных");
			ПроверяемыеРеквизиты.Добавить("ТекстФайла");
		ИначеЕсли ТипСлоя = Перечисления.гисТипыСлоев.WMS Тогда
			ПроверяемыеРеквизиты.Добавить("ГисСерверАдрес");
			ПроверяемыеРеквизиты.Добавить("ГисСерверИмяСлоя");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли