#Область ПрограммныйИнтерфейс

// Сравнивает ПериодичностьВход1 и ПериодичностьВход2. Возвращает
// Истину, если ПериодичностьВход1 больше. Когда параметр ВключаяРавенствоВход
// Истинный, также вернёт Истину при равенстве периодичностей.
Функция СравнитьПериодичность(ПериодичностьВход1, ПериодичностьВход2, ВключаяРавенствоВход = Ложь) Экспорт
	РезультатФункции = Истина;
	Если (ВключаяРавенствоВход) И (ПериодичностьВход1 = ПериодичностьВход2) Тогда
		РезультатФункции = Истина;
	Иначе
		Если ЗначениеЗаполнено(ПериодичностьВход1) Тогда
			ИндексПериодичности1 = Перечисления.Периодичность.Индекс(ПериодичностьВход1);
		Иначе
			ИндексПериодичности1 = 999;
		КонецЕсли;
		Если ЗначениеЗаполнено(ПериодичностьВход2) Тогда
			ИндексПериодичности2 = Перечисления.Периодичность.Индекс(ПериодичностьВход2);
		Иначе
			ИндексПериодичности2 = 999;
		КонецЕсли;
		РезультатФункции = ИндексПериодичности1 > ИндексПериодичности2;
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция формирует фамилию, имя и отчество одной строкой
//
// Параметры
//  Фамилия  - фамилия физ. лица.
//  Имя      - имя физ. лица.
//  Отчество - отчество физ. лица.
//  ФИОКратко    - Булево - если Истина (по умолчанию), Представление физ.лица включает фамилию и инициалы, если Ложь - фамилию и полностью имя и отчество
//
// Возвращаемое значение
//  Фамилия, имя, отчество одной строкой.
//
Функция ПолучитьФамилиюИмяОтчество(Фамилия = " ", Имя = " ", Отчество = " ", ФИОКратко = Истина) Экспорт

	Если ФИОКратко Тогда
		Возврат ?(НЕ ПустаяСтрока(Фамилия), Фамилия + ?(НЕ ПустаяСтрока(Имя)," " + Лев(Имя,1) + "." +
				?(НЕ ПустаяСтрока(Отчество) ,
				Лев(Отчество,1)+".", ""), ""), "");
	Иначе
		Возврат ?(НЕ ПустаяСтрока(Фамилия), Фамилия + ?(НЕ ПустаяСтрока(Имя)," " + Имя +
				?(НЕ ПустаяСтрока(Отчество) , " " + Отчество, ""), ""), "");
	КонецЕсли;

КонецФункции // ПолучитьФамилиюИмяОтчество()

#КонецОбласти
