#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		
Процедура ПередЗаписью(Отказ)
	
	Правообладатели 				= "";
	ВидыГосРегистрацииПрава 		= "";
	НомераГосРегистрацииПрава	 	= "";
	ДатыГосРегистрацииПрава 		= "";
	
	ВидыОбременений 				= "";
	ДатыГосРегистрацииОбременений 	= "";
	НомераГосРегистрацииОбременений = "";
	СрокиОбременений 				= "";
	ЛицаОбременений 				= "";
	ОснованияРегистрацииОбременений = "";
	
	Для Каждого СтрокаТЧ Из ПраваЗУ Цикл
		Правообладатели 			= Правообладатели 			+ ?(Правообладатели = "", "", "; ") 			+ СтрокаТЧ.Правообладатель;
		ВидыГосРегистрацииПрава 	= ВидыГосРегистрацииПрава 	+ ?(ВидыГосРегистрацииПрава = "", "", "; ")		+ СтрокаТЧ.ВидГосРегистрацииПрава;
		НомераГосРегистрацииПрава 	= НомераГосРегистрацииПрава + ?(НомераГосРегистрацииПрава = "", "", "; ") 	+ СтрокаТЧ.НомерГосРегистрацииПрава;
		ДатыГосРегистрацииПрава 	= ДатыГосРегистрацииПрава 	+ ?(ДатыГосРегистрацииПрава = "", "", "; ") 	+ СтрокаТЧ.ДатаГосРегистрацииПрава;
	КонецЦикла;
	
	Для Каждого СтрокаТЧ Из ОбремененияЗУ Цикл
		ВидыОбременений 				= ВидыОбременений 					+ ?(ВидыОбременений = "", "", "; ") 				+ СтрокаТЧ.ВидОбременения;
		ДатыГосРегистрацииОбременений 	= ДатыГосРегистрацииОбременений 	+ ?(ДатыГосРегистрацииОбременений = "", "", "; ") 	+ СтрокаТЧ.ДатаГосРегистрацииОбременения;
		НомераГосРегистрацииОбременений = НомераГосРегистрацииОбременений 	+ ?(НомераГосРегистрацииОбременений = "", "", "; ") + СтрокаТЧ.НомерГосРегистрацииОбременения;
		СрокиОбременений 				= СрокиОбременений 					+ ?(СрокиОбременений = "", "", "; ") 				+ СтрокаТЧ.СрокОбременения;
		ЛицаОбременений 				= ЛицаОбременений 					+ ?(ЛицаОбременений = "", "", "; ") 				+ СтрокаТЧ.ЛицоОбременения;
		ОснованияРегистрацииОбременений = ОснованияРегистрацииОбременений 	+ ?(ОснованияРегистрацииОбременений = "", "", "; ") + СтрокаТЧ.ОснованиеРегистрацииОбременения;
	КонецЦикла;
	
КонецПроцедуры
	
#КонецЕсли

	