
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УБХУправлениеФормой.УстановитьПредставлениеОтбора(ЭтотОбъект,,Метаданные.Справочники.Периоды);
	
	Если Параметры.Отбор.Свойство("Периодичность") И ЗначениеЗаполнено(Параметры.Отбор.Периодичность) Тогда				
		Элементы.Список.Отображение=ОтображениеТаблицы.Список;		
	Иначе		
		Элементы.Список.Отображение=ОтображениеТаблицы.ИерархическийСписок;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РеструктурироватьПериоды(Команда)
	
	РеструктурироватьПериодыСервер();
	
КонецПроцедуры

&НаСервере
Процедура РеструктурироватьПериодыСервер()
	
	Справочники.Периоды.РеструктурироватьПериоды();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПериод(Команда)
	
	Если ЗначениеЗаполнено(Элементы.Список.ТекущаяСтрока) Тогда
		ОткрытьФорму("Справочник.Периоды.Форма.ФормаЗаполненияПериодовУправляемая", Новый Структура("ПериодРодитель", Элементы.Список.ТекущаяСтрока), ЭтаФорма);
	КонецЕсли;

КонецПроцедуры