
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() И Не ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Объект.АлгоритмПереводаГост2008 = Истина;
	КонецЕСли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	АлгоритмПереводаПриИзменении(Элементы.АлгоритмПереводаГост2008);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АлгоритмПереводаПриИзменении(Элемент)
	Элементы.СтраницаДополнительно.Видимость = Не Объект.АлгоритмПереводаГост2008;
КонецПроцедуры

#КонецОбласти
