
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	// регистр гисЗначенияПоказателейОбъектов
	Движения.гисЗначенияПоказателейОбъектов.Записывать = Истина;
	Для Каждого СтрокаПоказателей Из Значения Цикл
		Движение = Движения.гисЗначенияПоказателейОбъектов.Добавить();
		Движение.Период = Дата;
		Движение.Показатель = Показатель;
		Движение.Объект = СтрокаПоказателей.ОбъектКарты;
		
		Если Показатель.ТипЗначения = Перечисления.гисПоказателиТипы.Число Тогда
			Движение.ЗначениеЧисло = СтрокаПоказателей.Значение;
		ИначеЕсли Показатель.ТипЗначения = Перечисления.гисПоказателиТипы.Булево Тогда
			Движение.ЗначениеБулево = СтрокаПоказателей.Значение;
		ИначеЕсли Показатель.ТипЗначения = Перечисления.гисПоказателиТипы.Справочник Тогда
			Движение.ЗначениеСправочник = СтрокаПоказателей.Значение;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли