#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Показатель = Параметры.Показатель;
	Дата = Параметры.Дата;
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	
	Заголовок = "Настройка тематики по слою " + Параметры.Слой;
	АвтоЗаголовок = Ложь;
	
	НовыйПараметр = Новый ПараметрВыбора("СлойКарты", Параметры.Слой);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.Показатель.ПараметрыВыбора = НовыеПараметры;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоказательОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Показатель) Тогда
		ОткрытьФорму("Справочник.гисПоказатели.ФормаОбъекта", Новый Структура("Ключ,СлойКарты", Показатель, Параметры.Слой));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрименитьИзменения(Команда)
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(Показатель) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран показатель!", , "Показатель", , Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбрана дата!", , "Дата", , Отказ);
	КонецЕсли;
	
	Если Не Отказ Тогда 
		ЭтотОбъект.Закрыть(Новый Структура("Показатель,Дата", Показатель, Дата));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
