#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УБХОбщегоНазначения.ОбновитьСоставСвязанныхОС(Неопределено, СвязанныеОС, Неопределено);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СвязанныеОСВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ОбъектПлощадки) ТОгда
		Возврат;
	КонецЕсли;
	
	ОткрытьЗначение(ТекущиеДанные.ОбъектПлощадки);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСоставСвязанныхОС(Команда)
	ОбновитьСоставСвязанныхОССервер();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьСоставСвязанныхОССервер()
	УБХОбщегоНазначения.ОбновитьСоставСвязанныхОС(Неопределено, СвязанныеОС, Неопределено);
КонецПроцедуры

#КонецОбласти