
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	УБХОбщегоНазначения.ОбновитьСоставСвязанныхОС(Объект.Площадка, СвязанныеОС, Объект.Ссылка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СвязанныеОСВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ОбъектПлощадки) ТОгда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(,ТекущиеДанные.ОбъектПлощадки);
КонецПроцедуры

&НаКлиенте
Процедура ПлощадкаПриИзменении(Элемент)
	СвязанныеОС.Очистить();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСоставСвязанныхОС(Команда)
	ОбновитьСоставСвязанныхОССервер();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьСоставСвязанныхОССервер()
	УБХОбщегоНазначения.ОбновитьСоставСвязанныхОС(Объект.Площадка, СвязанныеОС, Объект.Ссылка);
КонецПроцедуры

#КонецОбласти