
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Первоначальное заполнение справочника из макета.
//
Процедура ПервоначальноеЗаполнениеСправочника() Экспорт
	
	МакетРегионы = ПолучитьМакет("Регионы");
	
	Для Индекс = 1 По МакетРегионы.ВысотаТаблицы Цикл
		ТекущийКодРегиона = СокрЛП(МакетРегионы.Область(Индекс, 2, Индекс, 2).Текст);
		Название = СокрЛП(МакетРегионы.Область(Индекс, 1, Индекс, 1).Текст);
		
		// Ищем только по коду, так как в классификаторе все коды заданы.
		Ссылка = Справочники.УБХРегионы.НайтиПоКоду(ТекущийКодРегиона);
		ЭтоНовый = Не ЗначениеЗаполнено(Ссылка);
		Если ЭтоНовый Тогда
			Регион = Справочники.УБХРегионы.СоздатьЭлемент();
			Регион.Код 			= ТекущийКодРегиона;
			Регион.Наименование = Название;
			
			Регион.Записать();
		КонецЕсли; 
			
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
