
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Для Каждого ТочкаДействия Из Параметры.ТочкиЗаполняемыеПоПредмету Цикл
		ТочкиДействия.Добавить(ТочкаДействия.Значение, ТочкаДействия.Представление, Истина); 
	КонецЦикла;
	
	Для Каждого ТочкаДействия Из Параметры.ТочкиДоступныеПоПредмету Цикл
		Если ТочкиДействия.НайтиПоЗначению(ТочкаДействия.Значение) = Неопределено Тогда
			ТочкиДействия.Добавить(ТочкаДействия.Значение, ТочкаДействия.Представление);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	Результат = Новый Структура("ТочкиЗаполняемыеПоПредмету", ТочкиДействия);
	Закрыть(Результат);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры
