
&НаКлиенте
Процедура РеструктурироватьПериоды(Команда)
	Вн_РеструктурироватьПериоды();
	КартинкаОповещения = БиблиотекаКартинок.Успешно32;
	ТекстОповещения = НСтр("ru = 'Реструктуризация'");
	ПояснениеОповещения = НСтр("ru = 'Реструктуризация периодов завершена'");
	ПоказатьОповещениеПользователя(ТекстОповещения, , ПояснениеОповещения, КартинкаОповещения);
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура Вн_РеструктурироватьПериоды()
	
	Справочники.Периоды.РеструктурироватьПериоды();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПериод(Команда)
	
	Если ЗначениеЗаполнено(Элементы.Список.ТекущаяСтрока) Тогда
		ОткрытьФорму("Справочник.Периоды.Форма.ФормаЗаполненияПериодовУправляемая", Новый Структура("ПериодРодитель", Элементы.Список.ТекущаяСтрока), ЭтаФорма);
	КонецЕсли;

КонецПроцедуры
