
#Область ПрограммныйИнтерфейс

Функция ПолучитьТекстОкнаСообщений(ИдентификаторЧата) Экспорт
	
	Возврат лм_ВнутренниеКоммуникацииПользователей.ПолучитьТекстОкнаСообщений(ИдентификаторЧата);	
	
КонецФункции

Процедура ОтправитьСообщение(ИдентификаторЧата, ТекстСообщения, ВладелецЧата = Неопределено) Экспорт
	
	лм_ВнутренниеКоммуникацииПользователей.ОтправитьСообщение(ИдентификаторЧата, ТекстСообщения, ВладелецЧата);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

#КонецОбласти