
#Область ПрограммныйИнтерфейс

// Процедура формирования движений по регистру "Запросы клиентов ПБК".
//
// Параметры:
//	ДополнительныеСвойства - Структура - Свойства проведения
//	Движения - КоллекцияДвижений - Движения документа
//	Отказ - Булево - Признак отказа от проведения документа.
//
Процедура ОтразитьЗапросыКлиентовПБК(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Если Отказ Тогда
	
		Возврат;
		
	КонецЕсли;
	
	РеквизитыДокумента = ДополнительныеСвойства.РеквизитыДокумента;
	
	ДвиженияЗапросыКлиентов = Движения.УБХЗапросыКлиентовПБК;
	ДвиженияЗапросыКлиентов.Записывать = Истина;
	
	НовоеДвижение = ДвиженияЗапросыКлиентов.Добавить();
	ЗаполнитьЗначенияСвойств(НовоеДвижение, РеквизитыДокумента);
	
КонецПроцедуры

// Процедура формирования движений по регистру "Оборудование объекта ПБК".
//
// Параметры:
//	ДополнительныеСвойства - Структура - Свойства проведения
//	Движения - КоллекцияДвижений - Движения документа
//	Отказ - Булево - Признак отказа от проведения документа.
//
Процедура ОтразитьОборудованиеОбъектаПБК(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаОборудованиеОбъекта = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУБХОборудованиеОбъектаПБК;
	
	Если Отказ ИЛИ ТаблицаОборудованиеОбъекта.Количество() = 0 Тогда
	
		Возврат;
		
	КонецЕсли;
	
	ДвиженияДенежныеСредства = Движения.УБХОборудованиеОбъектаПБК;
	ДвиженияДенежныеСредства.Записывать = Истина;
	ДвиженияДенежныеСредства.Загрузить(ТаблицаОборудованиеОбъекта);
	
КонецПроцедуры

// Процедура обновления данных версии запроса.
//
// Параметры:
//	ДополнительныеСвойства - Структура - Свойства проведения
//	Отказ - Булево - Признак отказа от проведения документа.
//
Процедура АктуализироватьДанныеВерсииЗапроса(ДополнительныеСвойства, Отказ) Экспорт

	РеквизитыДокумента = ДополнительныеСвойства.РеквизитыДокумента;
	
	Если Отказ
		ИЛИ НЕ ЗначениеЗаполнено(РеквизитыДокумента.ТекущаяВерсияЗапроса) Тогда
	
		Возврат;
		
	КонецЕсли;
	
	ВерсияОбъект = РеквизитыДокумента.ТекущаяВерсияЗапроса.ПолучитьОбъект();	
	ВерсияОбъект.ЗапросНаРазмещение = РеквизитыДокумента.Ссылка;
	
	ВерсияОбъект.ПереченьОборудования.Загрузить(ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУБХОборудованиеОбъектаПБК);
	ВерсияОбъект.Записать();
	
КонецПроцедуры

// Процедура заполняет запрос на размещение по данным шаблона Excel.
//
// Параметры:
//	Параметры - Структура - Свойства проведения
//	Отказ - Булево - Признак отказа от проведения документа.
//
Процедура ЗаполнитьЗапросНаРазмещениеПоДаннымФайлаШаблона(Параметры) Экспорт


	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

