

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидСправочника     = Параметры.ВидСправочника;
	ЭтаФорма.Заголовок = ВидСправочника.Наименование;
	Список.Параметры.УстановитьЗначениеПараметра("ВидСправочника", Параметры.ВидСправочника);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ          = Истина;
	ПараметрыФормы = Новый Структура("ВидСправочника", ВидСправочника);
	ОткрытьФорму("Справочник.лм_УниверсальныеСправочники.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти
