////////////////////////////////////////////////////////////////////////////////
// Серверный модуль для методов общего назначения.
// Основное назначение:
//  - получение текущей версии подсистемы.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает версию подсистемы ГИС, которая хранится в информационной базе.
// 
// ВозвращаемоеЗначение:
//	 Строка - версия подсистемы в формате РР.ПП.ЗЗ.
//
Функция ПолучитьВерсиюПодсистемыГИС() Экспорт
	ВерсияПодсистемы = "0.0.0.0";
	
	Выборка = РегистрыСведений.ВерсииПодсистем.Выбрать(Новый Структура("ИмяПодсистемы", гисОбновлениеИнформационнойБазы.ПолучитьИмяПодсистемы()));
	Если Выборка.Следующий() Тогда
		ВерсияПодсистемы = Выборка.Версия;
	КонецЕсли;
	
	Возврат ВерсияПодсистемы;
КонецФункции

// Возвращает идентификатор информационной базы.
// 
// Возвращаемое значение:
//   - Строка - идентификатор информационной базы.
//
Функция ПолучитьИдентификаторИнформационнойБазы() Экспорт
	Возврат СтандартныеПодсистемыСервер.ИдентификаторИнформационнойБазы();
КонецФункции

#КонецОбласти
