////////////////////////////////////////////////////////////////////////////////
// Серверный модуль для работы с json.
// Основное назначение:
//  - читать и записывать json в одну строку.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Представляет указанный объект в виде строки json.
//
// Параметры:
//  ОбъектДанных	- Произвольный - объект для записи в строку json. 
//  				Должны быть использованы типы, с которыми стандартная ЗаписьJSON может работать.
//  Минимизировать	- Булево - Истина - строка json будет представлена одной строкой;
//							 - Ложь - будут использованы отступы для удобочитаемого вида.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ЗаписатьНативно(ОбъектДанных, Минимизировать = Истина) Экспорт
	Если Минимизировать Тогда
		ПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет);
	Иначе
		ПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Windows, Символы.Таб);
	КонецЕсли;
	ЗаписьJson = Новый ЗаписьJSON();
	ЗаписьJson.УстановитьСтроку(ПараметрыJSON);
	ЗаписатьJSON(ЗаписьJson, ОбъектДанных);
	Возврат ЗаписьJson.Закрыть();
КонецФункции

// Получает объект из строки json.
//
// Параметры:
//  Json				 - Строка - строка json, которую нужно представить объектом;
//  МассивСвойствДата	 - Массив - объекты с именами, значения которых необходимо преобразовать в дату.
// 
// Возвращаемое значение:
//   Произвольный - объект json.
//
Функция ПрочитатьНативно(Json, МассивСвойствДата = Неопределено) Экспорт
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(Json);
	ОбъектДанных = ПрочитатьJSON(ЧтениеJSON, , МассивСвойствДата);
	Возврат ОбъектДанных;
КонецФункции

#КонецОбласти
