
#Область ПрограммныйИнтерфейс

Процедура НачалоВыбораMDM(ДанныеВыбора, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт
	
	//Если ТипЗнч(ДополнительныеПараметры.Реквизит) = Тип("СправочникСсылка.ЭлементыКлассификаторов") Тогда
	//	ШаблонОбъект = ДополнительныеПараметры.Шаблон.ПолучитьОбъект();	
	//	МассивПредметовНСИ = Новый Массив;		
	//	ТипыСправочникиНСИ = Метаданные.ОпределяемыеТипы.СправочникиНСИ.Тип;
	//	Для Каждого Предмет Из ШаблонОбъект.Предметы Цикл
	//		СтрокаТипПредмета = Предмет.ТипПредмета.ПолноеИмя;
	//		МассивПодстрок = СтрРазделить(СтрокаТипПредмета, ".", Ложь);			
	//		ТипПредмета = Тип(МассивПодстрок[0] + "Ссылка." + МассивПодстрок[1]);
	//		Если ТипыСправочникиНСИ.СодержитТип(ТипПредмета) Тогда
	//			МассивПредметовНСИ.Добавить(Предмет.ТипПредмета);
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//	Если МассивПредметовНСИ.Количество() <> 0 Тогда
	//		МассивКГ = Новый Массив;
	//		
	//		Для Каждого ТипПредмета Из МассивПредметовНСИ Цикл
	//			Классификаторы = УправлениеНСИ.КлассификаторыСправочникаНСИ(ТипПредмета);	
	//			Для Каждого Классификатор Из Классификаторы Цикл
	//				КГКлассификатора = УправлениеНСИ.ПолучитьЭлементыКлассификаторовПоКлассификатору(Классификатор.Имя);
	//				Для Каждого КГ Из КГКлассификатора Цикл
	//					МассивКГ.Добавить(КГ);	
	//				КонецЦикла;
	//			КонецЦикла;
	//		КонецЦикла;
	//		
	//		ДополнительныеПараметры.Вставить("МассивКГ", МассивКГ);
	//	КонецЕсли;		
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

