#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	
	КоличествоАМС = 0;
	Для Каждого СтрокаТЧ Из ОбъектыПлощадки Цикл
		
		Если ТипЗнч(СТрокаТЧ.ОбъектПлощадки) = Тип("СправочникСсылка.УБХАМС") Тогда
			КоличествоАМС = КоличествоАМС + 1;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
	
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.УБХОбъектыПлощадок");
	ЭлементБлокировки.УстановитьЗначение("Площадка", Ссылка);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
 
	НаборЗаписей = РегистрыСведений.УБХОбъектыПлощадок.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Площадка.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	
	ТаблицаОбъектыПлощадки = ОбъектыПлощадки.Выгрузить();
	ТаблицаОбъектыПлощадки.Колонки.Добавить("Площадка", Новый ОписаниеТипов("СправочникСсылка.УБХПлощадки"));
	ТаблицаОбъектыПлощадки.ЗаполнитьЗначения(Ссылка, "Площадка");
	
	НаборЗаписей.Загрузить(ТаблицаОбъектыПлощадки);
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецЕсли
