
#Область ПрограммныйИнтерфейс

Процедура ВыбратьИсполнителя(ЭлементИсполнитель, РеквизитИсполнитель, ШаблонБизнесПроцесса, ТолькоПростыеРоли = Ложь, БезВнешнихРолей = Ложь) Экспорт 
	
	ПараметрыФормы = Новый Структура("Исполнитель, ТолькоПростыеРоли, БезВнешнихРолей, ШаблонБизнесПроцесса", 
		РеквизитИсполнитель, ТолькоПростыеРоли, БезВнешнихРолей, ШаблонБизнесПроцесса);
	ОткрытьФорму("ОбщаяФорма.ВыборИсполнителяБизнесПроцесса", ПараметрыФормы, ЭлементИсполнитель);
	
КонецПроцедуры

Процедура ПриИзмененииРеквизитаФормыЗадачи(Элемент, Форма, СоответствиеЗависимых, СоответствиеРеквизитов) Экспорт
	
	лм_БизнесПроцессыКлиентПереопределяемый.ПриИзмененииРеквизитаФормыЗадачи(Элемент, Форма, СоответствиеЗависимых, СоответствиеРеквизитов);	
	
КонецПроцедуры

Процедура ВыполнитьПереопределяемуюКоманду(Команда, Форма) Экспорт
	
	лм_БизнесПроцессыКлиентПереопределяемый.ВыполнитьПереопределяемуюКоманду(Команда, Форма);
	
КонецПроцедуры

Процедура ПриАктивизацииСтрокиТаблицыФормыЗадачи(Элемент, Форма) Экспорт
	
	лм_БизнесПроцессыКлиентПереопределяемый.ПриАктивизацииСтрокиТаблицыФормыЗадачи(Элемент, Форма);
	
КонецПроцедуры

Процедура НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, Форма) Экспорт
	
	лм_БизнесПроцессыКлиентПереопределяемый.НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, Форма);
	
КонецПроцедуры

Процедура Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка, Форма) Экспорт
	
	лм_БизнесПроцессыКлиентПереопределяемый.Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка, Форма);
	
КонецПроцедуры

Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник, Форма) Экспорт
	
	лм_БизнесПроцессыКлиентПереопределяемый.ОбработкаОповещения(ИмяСобытия, Параметр, Источник, Форма);
	
КонецПроцедуры

Процедура ПередНачаломДобавленияСтрокиТаблицыФормыЗадачи(Элемент, Отказ, Копирование, Родитель, Группа, Параметр, Форма) Экспорт
	
	лм_БизнесПроцессыКлиентПереопределяемый.ПередНачаломДобавленияСтрокиТаблицыФормыЗадачи(Элемент, Отказ, Копирование, Родитель, Группа, Параметр, Форма);
	
КонецПроцедуры

Процедура ПередУдалениемСтрокиТаблицыФормыЗадачи(Элемент, Отказ, Форма) Экспорт
	
	лм_БизнесПроцессыКлиентПереопределяемый.ПередУдалениемСтрокиТаблицыФормыЗадачи(Элемент, Отказ, Форма);
	
КонецПроцедуры

Процедура ПриОткрытииФормыЗадачи(Форма) Экспорт
	
	лм_БизнесПроцессыКлиентПереопределяемый.ПриОткрытииФормыЗадачи(Форма);
	
КонецПроцедуры

Процедура ПослеЗакрытияПодчиненнойФормы(Форма, Результат, ДополнительныеПараметры, СоответствиеЗависимых, СоответствиеРеквизитов) Экспорт
	
	лм_БизнесПроцессыКлиентПереопределяемый.ПослеЗакрытияПодчиненнойФормы(Форма, Результат, ДополнительныеПараметры, СоответствиеЗависимых, СоответствиеРеквизитов);
	
КонецПроцедуры

Процедура ПослеИнтерактивногоСозданияБизнесПроцесса(БизнесПроцесс) Экспорт
	
	лм_БизнесПроцессыКлиентПереопределяемый.ПослеИнтерактивногоСозданияБизнесПроцесса(БизнесПроцесс);
	
КонецПроцедуры

Процедура ПриОкончанииРедактированияСтрокиТаблицы(Форма, Элемент, НоваяСтрока, ОтменаРедактирования) Экспорт
	
	лм_БизнесПроцессыКлиентПереопределяемый.ПриОкончанииРедактированияСтрокиТаблицы(Форма, Элемент, НоваяСтрока, ОтменаРедактирования);
	
КонецПроцедуры

Процедура Подключаемый_ПриНачалеРедактированияСтрокиТаблицы(Форма, Элемент, НоваяСтрока, Копирование) Экспорт
	
	лм_БизнесПроцессыКлиентПереопределяемый.ПриНачалеРедактированияСтрокиТаблицы(Форма, Элемент, НоваяСтрока, Копирование);
	
КонецПроцедуры


#КонецОбласти