#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.УБХНазначениеСтатусовОбъектамМетаданных");
	ЭлементБлокировки.УстановитьЗначение("НазначениеСтатуса", Ссылка);

	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
 
	НаборЗаписей = РегистрыСведений.УБХНазначениеСтатусовОбъектамМетаданных.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.НазначениеСтатуса.Установить(Ссылка);
	
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Для Каждого СтрокаТЧ Из ИдентификаторыОбъектов Цикл
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.НазначениеСтатуса 		= Ссылка;
		ЗаписьНабора.ИдентификаторОбъекта 	= СтрокаТЧ.ИдентификаторОбъекта;
	КонецЦикла;
		
	НаборЗаписей.Записать();

КонецПроцедуры
	
#КонецЕсли
