
#Область ПрограммныйИнтерфейс

Процедура ПриЗаполненииРасширенныхНастроек(РасширенныеНастройки) Экспорт
	
// Подсистема лм_УправлениеБизнесПроцессами
	
	// РасширеннаяНастройкаНСИ
	Настройка               = лм_БизнесПроцессыКлиентСервер.НовоеОписаниеРасширеннойНастройкиФормы();
	Настройка.Имя           = "РасширеннаяНастройкаНСИ";
	Настройка.Наименование  = "Расширенная настройка для справочников НСИ";
	Настройка.Идентификатор = "aa00559e-ad84-4494-88fd-f0826edc46f0";
	
	//Реквизит                     = Модуль_БизнесПроцессыКлиентСервер.НовоеОписаниеРеквизитаРасширеннойНастройкиФормы();
	//Реквизит.Имя                 = "ИспользоватьНормализацию";	
	//Реквизит.Наименование        = "Использовать нормализацию";	
	//Реквизит.ТипЗначения         = Новый ОписаниеТипов("Булево");
	//Реквизит.ЗначениеПоУмолчанию = Ложь;	
	//Настройка.Реквизиты.Добавить(Реквизит);	
	
	Реквизит                     = лм_БизнесПроцессыКлиентСервер.НовоеОписаниеРеквизитаРасширеннойНастройкиФормы();
	Реквизит.Имя                 = "ОтображатьВВидеТаблицы";
	Реквизит.Наименование        = "Отображать реквизиты, атрибуты, КГ в виде таблицы";
	Реквизит.ТипЗначения         = Новый ОписаниеТипов("Булево");
	Реквизит.ЗначениеПоУмолчанию = Ложь;
	Настройка.Реквизиты.Добавить(Реквизит);
	
	//Реквизит                     = Модуль_БизнесПроцессыКлиентСервер.НовоеОписаниеРеквизитаРасширеннойНастройкиФормы();
	//Реквизит.Имя                 = "ИспользоватьКопированиеЗаявки";
	//Реквизит.Наименование        = "Использовать копирование заявки";
	//Реквизит.ТипЗначения         = Новый ОписаниеТипов("Булево");
	//Реквизит.ЗначениеПоУмолчанию = Ложь;
	//Настройка.Реквизиты.Добавить(Реквизит);
	
	Реквизит                     = лм_БизнесПроцессыКлиентСервер.НовоеОписаниеРеквизитаРасширеннойНастройкиФормы();
	Реквизит.Имя                 = "РазрешитьИзменениеПредмета";
	Реквизит.Наименование        = "Разрешить изменение предмета";
	Реквизит.ТипЗначения         = Новый ОписаниеТипов("Булево");
	Реквизит.ЗначениеПоУмолчанию = Ложь;
	Настройка.Реквизиты.Добавить(Реквизит);	
	
	Реквизит                     = лм_БизнесПроцессыКлиентСервер.НовоеОписаниеРеквизитаРасширеннойНастройкиФормы();
	Реквизит.Имя                 = "РазрешитьЗапускСвязанныхПодпроцессов";
	Реквизит.Наименование        = "Разрешить запуск связанных подпроцессов";
	Реквизит.ТипЗначения         = Новый ОписаниеТипов("Булево");
	Реквизит.ЗначениеПоУмолчанию = Ложь;
	Настройка.Реквизиты.Добавить(Реквизит);	
	
	Реквизит                     = лм_БизнесПроцессыКлиентСервер.НовоеОписаниеРеквизитаРасширеннойНастройкиФормы();
	Реквизит.Имя                 = "РазрешитьПросмотрПроцессовТекущейЗаписи";
	Реквизит.Наименование        = "Разрешить просмотр процессов текущей записи";
	Реквизит.ТипЗначения         = Новый ОписаниеТипов("Булево");
	Реквизит.ЗначениеПоУмолчанию = Ложь;
	Настройка.Реквизиты.Добавить(Реквизит);	
		
	РаботаСБизнесПроцессамиКлиентСерверПереопределяемый.ПриЗаполненииРасширеннойНастройки_НСИ(Настройка);
	
	РасширенныеНастройки.Добавить(Настройка);
// Конец Подсистема лм_УправлениеБизнесПроцессами

КонецПроцедуры

Функция ПрефиксРеквизитаСвязанныеЭлементы() Экспорт
	Возврат "Связанный_";
КонецФункции

Функция ЭтоРеквизитСвязанныеЭлементы(ОписаниеРеквизита, ОписаниеСтруктурыДанных = Неопределено) Экспорт
	Если ТипЗнч(ОписаниеРеквизита) = Тип("Строка") Тогда
		Возврат СтрНачинаетсяС(НРег(ОписаниеРеквизита), НРег(ПрефиксРеквизитаСвязанныеЭлементы()));
	ИначеЕсли ТипЗнч(ОписаниеРеквизита) = Тип("Структура") Тогда
		Возврат СтрНачинаетсяС(НРег(ОписаниеРеквизита.ИмяПоля), НРег(ПрефиксРеквизитаСвязанныеЭлементы()));
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

Функция ИмяРеквизитаСсылка_РеквизитаСвязанныеЭлементы(ИмяРеквизитаСвязанныеЭлементы, ОписаниеСтруктурыДанных = Неопределено) Экспорт
	Если Не ЭтоРеквизитСвязанныеЭлементы(ИмяРеквизитаСвязанныеЭлементы, ОписаниеСтруктурыДанных) Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Некорректное имя реквизита связанного справочника: %1'"), ИмяРеквизитаСвязанныеЭлементы);
	КонецЕсли;
	
	ИмяСвязанногоСправочника = Сред(ИмяРеквизитаСвязанныеЭлементы, СтрДлина(ПрефиксРеквизитаСвязанныеЭлементы()) + 1);
	
	ИмяРеквизитаСсылка = ИмяСвязанногоСправочника + "_Ссылка";
	
	Возврат ИмяРеквизитаСсылка;
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийОбъекта

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

